import i18n from "@languages";

export default errorCode = {
    // 登录errCode（00~49）
    "00": "昵称不能为空",
    "01": "无效的昵称（昵称仅支持中文，字母及数字）",
    "02": "昵称未注册，请注册后使用",
    "03": "已存在的昵称，请输入其他昵称",
    "04": "昵称最多支持12个字符",
    "05": "密码不能为空",
    "06": "密码不能少于8位",
    "07": "昵称与密码不匹配，请重新输入",
    "08": "登录失败，未知错误",

    // 注册errCode（50~99）
    "50": "昵称不能为空",
    "51": "无效的昵称（昵称仅支持中文，字母及数字）",
    "52": "当前昵称已注册，请直接登录或使用其他昵称进行注册",
    "53": "昵称最多支持12个字符",
    "54": "密码不能为空",
    "55": "密码不能少于8位",
    "56": "确认密码不能为空",
    "57": "确认密码不能少于8位",
    "58": "密码与确认密码不匹配",
    "59": "注册失败，未知错误"
}